l993889589/STM32/projects/stm32h563-h5/STM32H563RIV6_app/user/bsp/bsp_cache.c
/**
 * @file bsp_cache.c
 * @brief STM32H563 instruction/data cache ownership and maintenance.
 */

#include "bsp_cache.h"

#include <stddef.h>
#include <stdint.h>

#include "stm32h5xx_hal.h"

static DCACHE_HandleTypeDef g_dcache;
static uint8_t g_cache_initialized;

/** @brief Implement bsp_cache_init() without CubeMX cache source files. */
bsp_status_t bsp_cache_init(void)
{
    if(g_cache_initialized != 0U)
    {
        return BSP_STATUS_ALREADY_INITIALIZED;
    }

    if(HAL_ICACHE_Enable() != HAL_OK)
    {
        return BSP_STATUS_IO_ERROR;
    }

    __HAL_RCC_DCACHE1_CLK_ENABLE();
    g_dcache.Instance = DCACHE1;
    g_dcache.Init.ReadBurstType = DCACHE_READ_BURST_WRAP;
    if(HAL_DCACHE_Init(&g_dcache) != HAL_OK)
    {
        return BSP_STATUS_IO_ERROR;
    }

    g_cache_initialized = 1U;
    return BSP_STATUS_OK;
}

/** @brief Implement D-Cache clean for one DMA transmit range. */
bsp_status_t bsp_cache_clean(const void *address, uint32_t length)
{
    if((address == NULL) || (length == 0U))
    {
        return BSP_STATUS_INVALID_ARGUMENT;
    }
    if(g_cache_initialized == 0U)
    {
        return BSP_STATUS_NOT_READY;
    }
    return HAL_DCACHE_CleanByAddr(&g_dcache,
                                  (const uint32_t *)address,
                                  length) == HAL_OK ?
           BSP_STATUS_OK : BSP_STATUS_IO_ERROR;
}

/** @brief Implement D-Cache invalidate for one DMA receive range. */
bsp_status_t bsp_cache_invalidate(void *address, uint32_t length)
{
    if((address == NULL) || (length == 0U))
    {
        return BSP_STATUS_INVALID_ARGUMENT;
    }
    if(g_cache_initialized == 0U)
    {
        return BSP_STATUS_NOT_READY;
    }
    return HAL_DCACHE_InvalidateByAddr(&g_dcache,
                                       (uint32_t *)address,
                                       length) == HAL_OK ?
           BSP_STATUS_OK : BSP_STATUS_IO_ERROR;
}

/** @brief Implement cache-line boundary validation for receive-DMA buffers. */
uint8_t bsp_cache_is_line_aligned(const void *address, uint32_t length)
{
    uintptr_t start = (uintptr_t)address;

    return ((address != NULL) && (length != 0U) &&
            ((start & (BSP_CACHE_LINE_SIZE - 1U)) == 0U) &&
            ((length & (BSP_CACHE_LINE_SIZE - 1U)) == 0U)) ? 1U : 0U;
}
